// 상태 정의 
// - dp[i]: i칸있을 때 맨 끝칸에 도달하는 방법의 수
// 상태 전이 방정식
// - dp[i+2] = (dp[i+1]) + (dp[i]) 

// 초깃값 및 기저사례 설정
// * n<=2
// - dp[0] = 1;
// - dp[1] = 1; // 1
// - dp[2] = 2; // 1,1 / 2 


// n>2
// ex. dp[3] = dp[2] + dp[1] = 3 (1,1,1 / 1,2 / 2,1 )
// ex. dp[4] = dp[3] + dp[2] = 5  (1,1,1,1 / 1,2,1 / 2,1,1 & 1,1,2 / 2,2 )
// ex. dp[5] = dp[4] + dp[3] = 8  (1,1,1,1,1 / 1,2,1,1 / 2,1,1,1 / 1,1,2,1 / 2,2,1 )
//                                (1,1,1,2 / 1,2,2 / 2,1,2)


function solution(n) {
    const dp=new Array(n+1).fill(0);
    dp[0] = 1;
    dp[1] = 1;
    dp[2] = 2;
    
    for(let i=3;i<=n;i++){
        dp[i]=((dp[i-1] + dp[i-2]))%1234567;
        
    }
        
    return dp[n] ;
}